Revit.Elements.LinkInstance
A Revit Link Instance

Revit.Elements.LinkInstance.InternalLinkInstance
An internal handle on the Revit Link Instance

Revit.Elements.LinkInstance.InternalElement
Reference to the Element

Revit.Elements.LinkInstance.#ctor(Autodesk.Revit.DB.RevitLinkInstance)
Private constructor
linkInstance:

Revit.Elements.LinkInstance.InitLinkInstance(Autodesk.Revit.DB.RevitLinkInstance)
Initialize a Revit Link Instance element

Revit.Elements.LinkInstance.InternalSetLinkInstance(Autodesk.Revit.DB.RevitLinkInstance)
Set the InternalLinkInstance property and the associated element id and unique id
linkInstance:

Revit.Elements.LinkInstance.FromExisting(Autodesk.Revit.DB.RevitLinkInstance,System.Boolean)
Create a Revit Link Instance from a user selected Element
linkInstance:
isRevitOwned:
Returns:

Revit.Elements.LinkInstance.AllElementsAtLevel(Revit.Elements.LinkInstance,Revit.Elements.Level)
Retrieves all elements from a link instance on the given level
linkInstance: Linked Element Instance
level: Linked Element Level
List of elements

Revit.Elements.LinkInstance.AllElementsOfCategory(Revit.Elements.LinkInstance,Revit.Elements.Category)
Retrieves all elements of a given category in a link instance
linkInstance: Revit link Instance
category: Element category
All elements of the category

Revit.Elements.LinkInstance.AllElementsOfCategoryInView(Revit.Elements.LinkInstance,Revit.Elements.Category,Revit.Elements.Views.View)
Retrieves all elements of a category in a given view of a link instance
linkInstance: Revit link instance
category: Element category
view: View in active document
All elements of the category in the view

Revit.Elements.LinkInstance.AllElementsOfClass(Revit.Elements.LinkInstance,System.Type)
Retrieves all elements of a given class in a link instance
linkInstance: Revit link instance
elementClass: Element class in the link instance
All elements of the class in the link instance

Revit.Elements.LinkInstance.ByName(System.String)
Retrieves a link instance by name
name: Name of the link instance
Revit link instance

Revit.Elements.LinkInstance.ElementById(System.Object,Revit.Elements.LinkInstance)
Retrieves one or more elements by ID from a link instance
id: Element ID
linkInstance: Revit link instance
Element(s) from the link instance

Revit.Elements.LinkInstance.Document(Revit.Elements.LinkInstance)
Queries the link instance’s document
linkInstance:  Revit link instance
Document of link instance

Revit.Elements.LinkInstance.ByTitle(System.String)
Retrieves link instances by project title (file name)
title: Project title (file name)
Revil link instance